app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
UPDATE "articles" SET "rating" = -15, "updated_at" = '2011-10-10 17:41:43.462559' WHERE ("articles"."id" = 1)
---
  def rating
    @article = Article.find(params[:id])

    # Add article ID in a cookie, if not vote for her
    article_ids = cookies[:user_vote].present? ? Marshal.load(cookies[:user_vote]) : Array.new
    unless article_ids.include?(@article.id)
      @article.change_rating(params[:value].to_i)
      article_ids.push(@article.id)